let tasks = {
	say: ['Ամենահիշվող օրը', 'Հակառակ սեռի ամենասիրած անունը', 'Ամենաամոթալի օրը', 'Ամենաամոթալի պահը',
		'Ունե՞ս հավանած աղջիկ/տղա', 'Քանի՞ անգամ ես սիրահարվել', 'Ո՞ր երկիրն ես սիրում', 'Որտե՞ղ կուզենայիր ապրել',
		'Ե՞րբ ես վերջին անգամ լաց եղել և ինչու՞', 'Ե՞րբ և ինչպե՞ս ես իմացել ճշմարտությունը ձմեռ պապիկի մասին',
		'Ի՞նչ ես այսօր կերել վերջինը', 'Մասնակիցներից ու՞մ կուզենայիր ապտակել', 'Ու՞մ չէիր կանչի քո հարսանիքին մասնակիցներից',
		'Մասնակիցներից ումի՞ց ես նեղացել վերջին անգամ', 'Քո ամենամեծ վախը․․․', 'Ու՞մ կապտակեիր մասնակիցներից',
		'Տարվա ո՞ր ամիսը և ինչու՞', 'Սիրածդ երգիչը/երգչուհին', 'Սիրածդ դերասանը/դերասանուհին', 'Մասնակիցներից ու՞մ կգրկեիր հենց հիմա',
		'Ո՞վ է քեզ ամենահարազարտը ներկանեից', 'Ու՞մ ես ամենաքիչը վստահում', 'Մասնակիցներից ու՞մ կվստահեիր բացած հեռախոսդ 1 ժամով',
		'Ե՞րբ ես ստել վերջին անգամ', 'Ու՞մ և ինչպե՞ս ես սխաբել վերջին անգամ', 'Կյանքիդ ամենամեծ սուտը',
		'Կա՞ն քո շրջապատում մարդիկ ում ներկայությունից նյարդանում ես', 'Ո՞րն է քո թուլությունը', 'Քո ամենամեծ թերությունը',
		'Աջ մասնակցիդ լավագույն հատկանիշը', 'Աջ մասնակցիդ վատագույն հատկանիշը', 'Ձախ մասնակցիդ ամենաուժեղ կողմը',
		'Ձախ մասնակցիդ ամենաթույլ կողմը', 'Մասնակիցներից ամենածիծաղելին', 'Մասնակիցներից ու՞մ հետ ես պատրաստ միայնակ մնալ դատարկ սենյակում 1 օր',
		'Ինչի՞ց ես վախենում', 'Ո՞ր գույնը չես սիրում', 'Ո՞ր մասնակցին նայելիս ժպտում ես ամենաշուտը', 'Ու՞մ ես համարում ամենաուժեղը ներկաներից',
		'Ու՞մ սանրվածքն է ամենավատը', 'Ու՞մ պատրաստածը կուտեիր', 'Ի՞նչ լավ բան ես արել վերջին անգամ և ե՞րբ',
		'Կյանքիդ խորհուրդը', 'Բնութագրիր քեզ 3 բառով', 'Բնութագրիր ձախ մասնակցիդ 3 բառով', 'Բնութագրիր աջ մասնակցիդ 3 բառով',
		'Կյանքիդ նպատակ․․․', 'Ե՞րբ ես առաջին անգամ սիրահարվել', 'Ամենաչսիրած անունը տղայի և աղջկա', 'Ի՞նչը ոչ մի դեպքում չէիր ուզի կորցնել',
		'Ամենալավ նվերը որը ստացել ես', 'Ամենավատ նվերը որ քեզ տվել են', 'Ամենահետաքրքիր մասնակիցը․․․', 'Ներկաներից ամենաթույլ տրամաբանությունը ունի․․․',
		'Քեզ ո՞ր կենդանու հետ ես ասոցացնում', 'Աջ մասնակցին ո՞ր կենդանու հետ կասոցացնես', 'Ձախ մասնակցին ո՞ր կենդանու հետ կասոցացնես',
		'Փոքր տարիքիդ երազանքը/ցանկալի մասնագիտությունը', 'Ամենասխալ քայլդ', 'Մասնակիցներից ու՞մ կհեռացներիր հիմա խաղից',
		'Ամենաանուշադիր մասնակիցը․․․', 'Ամենագեղեցիկ մասնակիցը․․․', 'Ի՞նչ ես զգում նայելով աջ մասնակցիդ',
		'Ու՞մ նամակներն են գաղտնի կարդացել վերջին անգամ', 'Ի՞նչ ես խաբել ծնողներիդ վերջին անգամ', 'Երբևէ գողություն արե՞լ ես',
		'Ի՞նչ ամենաշատը կուզենայիր հենց հիմա լիներ քո ձեռքերում', 'Ո՞վ ես դու տանը՝երբ միայնակ ես', 'Ի՞նչ ես անում առաջինը, երբ տանն ես',
		'Ներկաներից ու՞մ հետ ես ամենաշատը նամակագրվում վերջերս', 'Կա՞ գաղտնիք, որը ներկաներից ոչ ոք չգիտի', 'Ամենատարօրինակ դեպքը կյանքում',
		'Ե՞րբ և ինչի՞ց ես զարմացել/ապշել վերջերս', 'Ինչո՞վ ես հպարտանում ամենաշատը', 'Ո՞վ է ներկաներից ամենաշատ սուտ ասողը',
		'Ամենաճշտապահ մասնակիցը դա․․․', 'Ո՞վ է ներկաներից իր պահվածքով ամենանմանը ինձ', 'Ո՞վ է իր բնավորությամբ ամենանմանը ինձ մասնակիցներից',
		'Մասնակիցներից ու՞մ կցանկանայի, որ լիներ իմ հարազատ քույրը/եղբայրը', 'Օրական քանի՞ ժամ եմ քնում',
		'Ու՞մ տանը կգիշերեիր ներկաներից, եթե դրա կարիքը լիներ', 'Աջ մասնակցի ո՞ր հատկանիշը կցանկանայիր ունենալ', 'Ձախ մասնակցի ո՞ր հատկանիշը կցանկանայիր ունենալ',
		'Ներկաներից ու՞մ կյանքով կուզենայիր ապրել', 'Ու՞մ ես համարում ամենահաջողակը մասնակիցներից', 'Ասա քո գլխավոր թերությունը',
		'Ե՞րբ և ինչպե՞ս ես հասկացել որ էլ երեխա չես', 'Վստահու՞մ ես քո ներքին ձայնին', 'Մասնակիցներից քանիսի՞ն կտրամադրեիր քո ամբողջ օրը, իրեն օգնելու համար',
		'Ներկաներից ու՞մ գաղտնիքը կուզենայիր իմանալ', 'Ումի՞ց ես ամենաշատը վախենում այս ներկաներից', 'Ի՞նչ սպորում կուզենայիր լինել լավագույններից մեկը',
		'Ներկաներից ու՞մ հետ նույն սենյակում չէիր քնի ոչ մի դեպքում', 'Տուր խորհուրդ քո աջ մասնակցին', 'Տուր խորհուրդ քո ձախ մասնակցին',
		'Ի՞նչ պլաններ ունես վաղը', 'Համարում ե՞ս քեզ ծանրաբեռնված', 'Կարող ե՞ս ապրել 1 օր առանց հեռախոսի', 'Մասնակիցներից ու՞մ գաղտնիքները հիմա գիտես',
		'Համարում ե՞ս քեզ աշխատասեր', 'Եղե՞լ է, երբ ինչ-որ բանի շատ պատրաստվես ու անսպասելի ամեն ինչ սխալ ստացվի, ու փչանա',
		'Ասա քո գլխավոր թերությունները', 'Եղե՞լ է որ ինչ-որ մեկի մասին մտածես գիշերը և ուշ քնես', 'Եթե գրեիր  գիրք, ի՞նչ թեմայով կլիներ',
		'Ու՞մ սանրվածքն է ամենավատը մասնակիցներից', 'Ի՞նչ կանեիր, եթե մնար 1 օր ապրելու', 'Մասնակիցներից ու՞մ ես ամենաշատը խաբել',
		'Ո՞ր բնավորությունիցդ կազատվեիր', 'Ու՞մ կյանքն է հետաքրքրում ներկաներից', 'Ինչպե՞ս ես ծանոթացել քո աջ մասնակցի հետ',
		'Ինչպե՞ս ես ծանոթացել քո ձախ մասնակցի հետ', 'Քանի՞ ամենավստահելի մարդ ունես', 'Համարում ե՞ս քեզ գաղտնապահ',
		'Կուզեի՞ր քո լավագույն ընկերը լիներ հենց քո պես, ինչու՞', 'Կյանքիդ գլխավոր նպատակը', '1 նախադասությամբ քո անցյալը բնութագրի',
		'1 նախադասությամբ քո ապագան բնութագրի', 'Ասա բան, որը չգիտեն քո մասին ներկաներից ոչ մեկը', 'Ե՞րբ ես ապշել վերջի անգամ',
		'Վերջին հիասթափության դեպքդ', 'Վերջին անգամ ե՞րբ ես զգացել կարոտի զգացում', 'Ի՞նչ ես անում երբ տխուր ես',
		'Ի՞նչն է բարձրացնում քո տրամադրությունը միանգամից', 'Մոտակա պլանավորոծ նպատակդ', 'Ի՞նչն ես գնահատում մարդու մեջ ամենաշատը',
		'Ո՞ր մարդկանց տանել չես կարողանում', 'Ինչը՞ չես սիրում մարդկանց մեջ', 'Քո ամենավատ սովորությունը',
	],
	do: ['Մինչև հաջորդ քո քարտը գալը աչքերդ փակ պահի', 'Թող որ քոեզնից աջ մասնակիցը հարվածի գլխիդ',
		'Թող քեզնից ձախ մասնակիցը ապտակի քեզ', 'Բռնի աջ կողմի մասնակցի ձեռքը մինչև նրա հերթը գա', 'Բռնի ձախ մասնակցի ձեռքը մինչև նրա հերթը գա',
		'Դու նույնպես կանես հաջորդ անգամ բացվող գործողությունը՝ մյուս մասնակցի հետ',
		'Թող քո աջ մասնակիցը մտնի սոց էջերիցդ մեկը 2 րոպեով', 'Թող քո ձախ մասնակիցը մտնի քո սոց էջերից մեկը մինչև քո հաջորդ հերթը գալը',
		'Պարիր այն երաժշտության տակ, որը կդնի քո աջ մասնակիցը', 'Երգիր որևէ երգի հատված քո ցանկությամբ', 'Արա այն ինչը կասի ձախ մասնակիցդ',
		'Արա այն ինչը կասի աջ մասնակիցդ', 'Թող քո մեջքից հարվածր ձախ մասնակիցդ', 'Փոխիր քո սոց էջի նկարը աջ մասնակցիդ ցանկությամբ որոշ ժամանակով',
		'Ցույց տուր վերջին արվածդ նկարը հեռախոսի մեջ', 'Վերջին հակառակ սեռի ներկայացուցիչը, ում հետ նամակագրվել ես',
		'Թող քո ձեռքին գրիչով դաջվածք անի ձախ մասնակիցդ', 'Թող քո ձեռքին դաջվածք անի աջ մասնակիցդ',
		'Թող ձեռքից նկարեն քեզ և գրեն քո անունը նկարի տակ', 'Պահիր քեզ հակառակ սեռի ներկայացուցչի պես մինչև քո հաջորդ հեթը գա',
		'Սիրո խոստովանություն արա աջ մասնակցիդ', 'Սիրո խոստովանություն արա ձախ մասնակցիդ', 'Ձեռքերդ դիր գլխիդ ու սպասիր քո հաջորդ հերթին',
		'Ձևացրու թե հավ ես', 'Ձևացրու որ սոված շուն ես', 'Արա այն, ինչ կանեիր, եթե քո ձախ մասնակիցը քեզ սեր խոստովաներ',
		'Արա այն, ինչ կանեիր, եթե քո աջ մասնակիցը քեզ սեր խոստովաների', 'Փակիր աչքերդ, թող մասնակիցները փոխվեն տեղերով ու փակ աչքերով կռահիր քո աջ մասնակցին',
		'Պատկերացրու դու քո ձախ մասնակցի հեռու բարեկամն ես, ով նոր վերադարձավ տուն 5 տարի անց', 'Պահիր քեզ այնպես, կարծես քո աջ մասնակցի հայրն/մայրն ես',
		'Պահիր քեզ այնպես, կարծես քո ձախ մասնակցի հայրն/մայրն ես', 'Ձևացրու որ հիվանդ պապիկ ես մինչև քո հաջորդ հերթը',
		'Ձևացրու որ եսասեր, գլուխգովան մարդ ես մինչև քո հաջորդ հերթը', 'Գովիր քո աջ մասնակցին', 'Գովիր քո ձախ մասնակցին',
		'Մինչև հաջորդ հարթդ գալը շարժվիր դանդաղացրած կադրով', 'Պատկերացրու դու մուրացկան ես և գումար ես խնդրում աջ մասնակցից',
		'Պահիր քեզ կույրի պես մինչև հաջորդ հերթիդ գալը', 'Դու ընդհանրապես բան չես լսում մինչև քո հաջորդ հերթը',
		'Փակիր քիթդ մինչև հաջորդ հերթդ', 'Ձախ մասնակիցդ ընտրում է թեմա, իսկ դու վիճում ես քո աջ մասնակցի հետ այդ թեմայով',
		'Ձախ մասնակցիդ ասած բառով դու բնութագրում ես քեզ 1 նախադասությամբ', 'Աջ մասնացի ասած մասնագիտության մասնագետ ես մինչև հաջորդ հերթդ',
		'Աջ մասնակիցը խառնում է մազերդ :)', 'Աջ և ձախ մասնակիցներդ խաղում են քար-թուղթ-մկրատ ու հաղթողը կտացնում է գլխիդ',
		'Պատկերացրու 6-ամյա երեխա ես մինչև քո հաջորդ քարտը', 'Դու քո աջ մասնակցի ծառան ես 2 րոպեով', 'Դու քո ձախ մասնակցի ծառան ես 2 րոպեով',
		'Թող քո ճակատին գրեն որևէ 1 գոյական', 'Թող ձեռքիդ ափին գրեն ինչ-որ անուն', 'Պահիր բերանդ բաց մինչև քո հաջորդ հերթը',
		'Ծիծաղեցրու մասնակիցներից մեկին, մինչև նա ժպտա', 'Մնա 1 ոտքի վրա մինչև քո հաջորդ հերթի գալը', 'Աջ կողմի մասնակիցը մտածում է քեզ անուն, որով կդիմեն ամբողջ խաղի ընթացքում',
		'Ձախ կողմի մասնակիցը մտածում է մականուն, որով քեզ կդիմեն մինչև խաղի ավարտը', 'Զանգիր ընկերներիցդ մեկին ու ասա որ պերտավոր է գումար տրամադրի ինչ-որ բանի համար',
		'Զանգիր ընկերներիցդ մեկին ու ասա որ այս համարին այլևս չզանգի ինչ-որ(դու որոշիր) պատճառով', 'Զանգիր ընկերներից մեկին ու ասա որ զբաղված եմ, հետո կզանգեմ',
		'Զանգի ընկերներիցդ մեկին ու ասա որ ինչ-որ(դու որոշիր) բանջարեղենի/մրգի գինը թանկացել է', 'Զանգիր ընկերներիցդ մեկին ու ասա որ սիրահարվել ես իր մոտիկ մարդկանցից մեկին',
		'Զանգիր ընկերներիցդ մեկին ու հարցրու թե նա քեզ ինչքա՞ն է սիրում', 'Անդադար ծափ տուր մինչև կգա քո հաջորդ հերթը', 'Քարացիր այն դիրքում, որում հիմա ես ու մնա մինչև քո հաջորդ հերթը',
		'Ամեն ժպտալուց քո թևից կհարվածի աջ մասնակիցդ, մինչև հաջորդ քո հերթը', 'Ընդունիր լուրջ մարդու տեսք մինչև քո հաջորդ հերթի գալը',
		'Պահիր քեզ գժի/հոգեկանի պես մինչև հաջորդ հերթդ', 'Ձախ մասնակիցը հարվածում է քո թևից', 'Պատկերացրու դու պարք ես քո աջ մասնակցին ու նա հետ է պահանջում պարքը',
		'Դու սիրահարվել ես քո ձախ մասնակցի աղջկան/տղային և հիմա խոսում ես այդ մասնակցի հետ', 'Դու հավանել ես քո աջ մասնակցի ամենամոտ ընկերոջը/ընկերուհուն և հարցուփորձ ես անում աջ մասնակցից',
		'Դու բժիշկ ես ու բուժման խորհուրդ ես տալիս աջ մասնակցիդ', 'Դու դատարանում մեղադրվում ես ձախ մասնակցիդ տունը թալանելու մեջ, աջ մասնակցդ՝ դատավորն է',
		'Դու մարդկային լեզուն չհասկացող շուն ես մինչև քո հաջորդ հերթը գալը', 'Ընդունիր նախամարդու կերպար մինչև քո հաջորդ հերթը',
		'Դու շոկոլադի ծառ ես, մինչև քո հաջորդ հերթը գալը', 'Աջ մասնակիցը ընտրում է առարկա, իսկ դու պետք է այն խոսքով վաճառես ձախ մասնակցիդ',
		'Ձախ մասնակիցդ ասում է թե դու ինչ ես, աջ մասնակիցդ՝ թե ինչպիսին ես, և դու պահում ես քեզ համապատասխան',
		'Նամակ գրի քո վերջին գրած մարդկանցից մեկին, ու ասա որ իր գաղտնիքը բոլորին ասել ես', 'Մասնակիցներից ովքե՞ր են քո ամենավատ/անհարմար վիճակներին ինչ-որ բանով քեզ օգնել',
		'Առանց ո՞ր մասնակցի հետաքրքիր չէր լինի այս խաղը', 'Առանց ո՞ր մասնակցի կյանքիդ օրերը այլ ձև կլինեին, ավելի վատ',
		'Տես որ մասնակիցներն են պատրաստ այս պահին քեզ գրկել․ ընտրիր մեկին', 'Բեր օրինակ, երբ քեզ սխալմամբ մեղադրել են ինչ-որ բանի մեջ',
		'Մարզանք արա մինչև քո հաջորդ հերթը', 'Երբ քո անունը տա աջ մասնակիցդ, ասա - այո տե՛ր', 'Զանգիր ընկերներիցդ մեկին ու ասա որ շունդ/կատուդ կորել է',
		'Ձևացրու իփր մահանում ես, իսկ պատճառը կընտրի ձախ մասնակիցդ', 'Դու արձան ես մինչև քո հաջորդ հերթը, իսկ դիրքը կընտրի աջ մասնակիցը',
		'Ձևացրու թե նեղացել ես աջ մասնակցից, պատճառը կասի ձախ մասնակիցը', 'Մեջքիդ հարվածում են այն մասնակիցները, ովքեր ուզում են',
		'Մինչև հաջորդ քո հերթը ամեն խոսելուց կստանաս ձախ մասնակցից հարված', 'Գլուխդ պատին տուր', 'Մինչև քո հաջորդ հերթը, ձևացրու թե ամեն ինչից վախենում ես'
	],
	say2: ['ակնոցավոր կանաչի', 'գաղտնի դուռ', 'բոբիկ լոլիկ', 'հպարտ ձմերուկ', 'երկար կրյա', 'դանդաղ սոխ', 'բարձրահասակ բանան',
		'հաստ եղունգ', 'անթրաշ տատիկ', 'աղքատ աքլոր', 'սիրուն ուխտ', 'կարճատես պիցցա', 'ուղիղ շրջան', 'հարմար ափսե',
		'չհասած դույլ', 'խակ տուն', 'ոսկե սեղան', 'տարօրինակ խաղ', 'սպասված տառասխալ', 'շեղ կշեռք', 'բարձր հատակ',
		'խիտ մաշկ', 'խորը պատ', 'խիստ խնձոր', 'շատակեր նորապսակ', 'Մակեդոնացու ձի', 'սոված Մերի', 'հաստավիզ պահակ',
		'աղի կաղամբ', 'թթու հաց', 'հայկական պինգվին', 'արևելյան արևմուտք', 'ներքին ձուկ', 'թանկարժեք քամի',
		'չաշխատող մեղու', 'բուսակեր կով', 'լավատես մողես', 'երջանիկ կարապ', 'սև մածուն', 'երկարաթև նասկի',
		'կիսաբաց դուռ', 'կրկնակի հարված', 'եսասեր հովիվ', 'հիվանդ մեքենա', 'անմահացած շուն', 'հեռատես ապագա',
		'մահացած նավ', 'պատմական սերիալ', 'չորացած աղավնի', 'սրտաբաց կենգուրու', 'բեղավոր սկյուռիկ', 'պարապ դերասան',
		'քնած հիվանդություն', 'քաղաքական ձեռքեր', 'ցուրտ արեգակ', 'դառը պանիր', 'գաղտնապահ հեռախոս', 'սիրահարված ֆուտբոլ',
		'գրավիչ մոծակ', 'մաքուր վառարան', 'կեղտոր քամի', 'հայրենասեր բարդի', 'եկամտաբեր պարտք', 'մեծացրած կաթնաուն',
		'խրոխտ շշուկ', 'աննորմալ վարդ', 'խաղաղ մայրցամաք', 'հնդկական պատ', 'արգելված թթվածին', 'թունավոր շոկոլադ',
		'քաղցրասեր ելակ', 'ախորժալի բադրջան', 'երջանիկ մոլախոտ', 'զզվելի կոնֆետ', 'ճերմակ բեղեր', 'հսկա ոտնաձայն',
		'լեռնային կապիկ', 'շնչավոր ցանկապատ', 'երկաթե ստամոքս', 'զուսպ սպասք', 'պարաճանաչ գիլաս', 'հանրահայտ ցատկ',
		'կոտրված գրպան', 'քնկոտ զարդուցիչ', 'համբերատար կոկոս', 'անապահով կատու', 'կասկածելի սրիկա', 'անվստահելի ուղեղ',
		'ժամկետնանց խոստովանություն', 'սիրային տոլմա', 'վրացական լավաշ', 'էժան լեռնագագաթ', 'վաճառված խմորեղեն',
		'կանացի երազանք', 'տանջված կացին', 'բացահայտ ծաղիկ', 'աճող ժողովուրդ', 'կուշտ աստղ', 'առաջին գյուղացի',
		'երկերես մատուցող',
	],
}
for (let i = 0; i < tasks.say2.length; i++) {
	tasks.say2[i] = '*' + tasks.say2[i]
}
tasks.all = [...tasks.say, ...tasks.do, ...tasks.say2,]
console.log(tasks.all.length)
console.log(tasks.say.length)
window.onload = function () {
	let count = document.querySelector('.count').value
	document.querySelector('.start-btn').addEventListener('click', () => {
		count = document.querySelector('.count').value
		if (count > 1) {
			document.querySelector('.home').style.display = 'none'
			document.querySelector('.game').style.display = 'flex'
			game(count)
		}
	})

	for (let i = 0; i < document.querySelectorAll('.card').length; i++) {
		document.querySelectorAll('.card')[i].addEventListener('click', () => {
			document.querySelector('.cards').style.display = 'none'

			if (document.querySelectorAll('.card')[i].getAttribute('data-value') == 'say') {
				document.querySelector('.task').innerHTML = tasks.say[randomIntFromInterval(0, tasks.say.length - 1)]
			} else if (document.querySelectorAll('.card')[i].getAttribute('data-value') == 'do') {
				document.querySelector('.task').innerHTML = tasks.do[randomIntFromInterval(0, tasks.do.length - 1)]
			} else if (document.querySelectorAll('.card')[i].getAttribute('data-value') == 'say2') {
				document.querySelector('.task').innerHTML = tasks.say2[randomIntFromInterval(0, tasks.say2.length - 1)]
			} else if (document.querySelectorAll('.card')[i].getAttribute('data-value') == 'all') {
				document.querySelector('.task').innerHTML = tasks.all[randomIntFromInterval(0, tasks.all.length - 1)]
			}
			document.querySelector('.task-board').style.display = 'flex'
		})
	}

	document.querySelector('.next').addEventListener('click', () => {
		document.querySelector('.to-home').style.display = 'none'
		document.querySelector('.task-board').style.display = 'none'
		game(count)
	})

	document.querySelector('.to-home').addEventListener('click', () => {
		document.querySelector('.task-board').style.display = 'none'
		document.querySelector('.cards').style.display = 'none'
		document.querySelector('.number').style.display = 'none'
		document.querySelector('.to-home').style.display = 'none'

		document.querySelector('.home').style.display = 'flex'
	})

	function game(count) {
		document.querySelector('.number').classList.remove('active')
		document.querySelector('.number').classList.remove('small')
		document.querySelector('.number').style.display = 'flex'
		document.querySelector('.number').style.animation = 'scale 0.5s infinite alternate-reverse'
		let interval = setInterval(() => {
			document.querySelector('.number').innerHTML = randomIntFromInterval(1, count)
		}, 100)
		setTimeout(() => {
			clearInterval(interval)
			document.querySelector('.number').style.animation = 'none'
			setTimeout(() => {
				document.querySelector('.number').classList.add('active')
				setTimeout(() => {
					document.querySelector('.cards').style.display = 'grid'
					document.querySelector('.to-home').style.display = 'block'
					document.querySelector('.number').classList.add('small')
				}, 500)
			}, 100)
		}, 1800)
	}

	function randomIntFromInterval(min, max) { // min and max included 
		return Math.floor(Math.random() * (max - min + 1) + min)
	}
}